[
  {
    "introImage": "/images/pictures/classpass-intro.png",
    "site": "classpass.com",
    "url": "classpass",
    "siteLink": "https://classpass.com/",
    "logo": "/images/logo/products-logo/classpass-logo.svg",
    "features": [
      "Fitness",
      "Wellness",
      "Sports"
    ],
    "introText": "ClassPass is a monthly fitness membership that lets you work out at over 7,000 of the best studios and gyms in your area and worldwide. With a ClassPass membership, you get access to unlimited classes in everything from yoga to Pilates to strength training and cycling.",
    "productTeam": [
      "2 Backend developers",
      "1 Frontend developer",
      "1 Product Manager",
      "2 QA Automation Engineers",
      "1 Technical Architect (CTO)"
    ],
    "fundingStage": [
      "Seed to Series B"
    ],
    "services": [
      "Backend Development",
      "QA Automation",
      "Technical Architecture"
    ],
    "techologies": [],
    "challengeText": "Classpass was a web only monolithic platform when they engaged RPS to address performance and consistency issues and build a robust and scalable platform.",
    "solutionsTexst": "RPS worked closely with the internal product & engineering team to resolve a critical issue relatedto the class reservation process and help the platform to scale during the peak noon booking window. The next step for our engagement was to build a robust and scalable API to support ClassPass’ new iOS native app. RPS built the API using the BDD process to ensure confidence in the API and provide the use-case documentation via functional tests.\n\nBy working closely with the mobile development team, we were able to deliver the initial MVP in three months. We continued moving away from the original web platform towards the API-centric platform, and within a year the web app was using the API to perform business functions.\n\nDuring the summer of 2015 RPS focused on supporting Classpass’ transition from a single subscription plan to a multi-tier model. RPS worked closely with the internal team to gather requirements, set expectations, and discuss architecture to ensure alignment. End-to-end implementation and testing was completed within two months, on time for the scheduled announcement date.\n\nAt the end of the work the existing users were seamlessly transitioned to their corresponding plans, supported by the new subscription model. RPS implemented a battery of functional tests to ensure the proper implementation of the use-cases; this allowed Users to seamlessly upgrade or downgrade their plans based on their needs with no interruption of service.",
    "results": [
      "- Fixed the reservation system to prevent overbooking and improved scalability and performance.",
      "-  Launched mobile app MVP within 3 months.",
      "- Transitioned from monolithic to microservices architecture, improving the long-term stability of the system",
      "- Created architecture and released a multi-tier subscription model within 2 months.",
      "- Documented and tested API use-cases using functional tests."
    ],
    "businessImpactText": "We began working with ClassPass in 2014 after their seed round. While working with Remedy, ClassPass raised a $12M Series A in 2014 and a $40M Series B in early 2015; they raised a $30M B extension in late 2015, just after we concluded our engagement.\n\nClassPass scaled from a few US cities to serve users nationwide and in select international markets. During our 2+ year engagement the engineering team at ClassPass grew from 3 to over 30 with Remedy helping onboard and transition core team members."
  },
  {
    "introImage": "/images/pictures/B6A-intro.png",
    "site": "blocksixanalytics.com",
    "url": "blocksixanalytics",
    "siteLink": "https://www.blocksixanalytics.com/",
    "logo": "/images/logo/products-logo/b6a-logo.svg",
    "features": [
      "Sports",
      "Analytics",
      "Machine Learning"
    ],
    "introText": "Block Six Analytics is a data-driven sports sponsorship management platform and marketplace. Sports properties, agencies and brands use B6A’s analytics platform to maximize ROI on their sports sponsorship spend across all advertising channels. Partners include Pepsi, Citi, Miami Heat, Cleveland Browns, Soldier Field (home of the Chicago Bears), and Comcast SportsNet.",
    "productTeam": [
      "2 Backend developers",
      "1 Frontend developer",
      "1 Product Manager",
      "1 UX/UI Designer",
      "1 Technical Architect (CTO)"
    ],
    "fundingStage": [
      "Friends & Family to Series A"
    ],
    "services": [
      "Backend Development",
      "Frontend Development",
      "Data Science",
      "API Development",
      "Product Management",
      "UX/UI Design",
      "QA Automation",
      "Technical Architecture"
    ],
    "techologies": [
      "/images/logo/tools/react.svg", 
      "/images/logo/tools/php.svg", 
      "/images/logo/tools/python.svg", 
      "MySQL", 
      "/images/logo/tools/aws.svg", 
      "WebSockets", 
      "Chef"
    ],
    "testimonials": {
      "avatar": "/images/avatars/b6a-ceo-avatar.png",
      "name": "Adam Grossman",
      "position": "Founder & CEO",
      "comment": "\"B6A has leveraged RPS resources to solve difficult challenges for our Software as a Service (SaaS) and machine learning platforms. RPS has been able to scale up teams with the specific skill sets critical for our past and future growth as a company. We would not be in the position we are in now without the help of RPS.\""
    },
    "challengeText": "RPS needed to build the new product, while maintaining support for B6A customers on the existing platform.",
    "solutionsTexst": "Block Six Analytics had been in development for over 4 years before engaging RPS. RPS was brought in to replace the existing legacy product with a modern, scalable solution. Our design team presented several options of how to make the product more user friendly. After the design approach was selected, the team created and executed a technical plan to transition from the outdated platform to the new solution.\nThe legacy platform was built as a monolithic PHP application; the new architecture utilized a combination of React/Redux SPA with the support of a custom backend API using Python. Technical steps involved adding initial API support to the legacy application and transitioning API’s to the new stack as product development progressed to guarantee uninterrupted service. Within 3 months RPS completely replaced the client facing functionality and moved on to admin/back office development.\n New features required Machine Learning (Media analysis platform) integration to process games and visualize on-screen sponsorship results, Social Sentiment Analysis Platform (natural language processing) for Twitter Instagram and Facebook.",
    "results": [
      "- Fixed the reservation system to prevent overbooking and improved scalability and performance.",
      "- Launched web app MVP within 3 months.",
      "- Integrated released machine learning and natural language processing suite.",
      "- Documented and tested API use-cases using functional tests."
    ],
    "businessImpactText": "Remedy worked with Block Six Analytics from 2012 through 2017. During this time Block Six Analytics raised a $2M Seed Round, led by Bowery Capital and follow-on funding from notable angel investors, including NBA superagent David Falk. B6A grew to service a multitude of sports properties and consumer brands, including the Detroit Lions, Wisconsin Badgers, and Marketcast."
  },
  {
    "introImage": "/images/pictures/ritual-picture.png",
    "site": "ritual.io",
    "url": "ritual",
    "siteLink": "https://www.ritual.io/",
    "logo": "/images/logo/products-logo/ritual-logo.svg",
    "features": ["Wellness", "Mental Health", "Education"],
    "introText": "Ritual is a cross-platform mobile application with a range of audio guided practices that can help boost and sustain wellbeing. Rather than focusing on a single practice, Ritual shares a diverse range of expert-guided wellbeing practices to find what works for each user. The app collaborates with renowned scientific, spiritual and cultural leaders to build their wisdom into guided audio experiences",
    "productTeam": [
      "1 backend developer",
      "1 frontend developer",
      "1 designer",
      "1 product manager"
    ],
    "fundingStage": [
      "Pre-Seed to Seed"
    ],
    "techologies": [
      "/images/logo/tools/react.svg",
      "React Native",
      "FastApi",
      "GraphQL",
      "/images/logo/tools/terraform.svg",
      "/images/logo/tools/aws.svg"
    ],
    "testimonials": {
      "avatar": "/images/avatars/ritual-head-avatar.png",
      "name": "Dante Doig-Acuña",
      "position": "Head of Product",
      "comment": "\"For an early startup like us, working with RPS has been a game-changer. I’d worked with engineering agencies in the past, and RPS went so far beyond that. The RPS team has been a key part of product, design, and even growth strategy, from the very beginning. This is a crew of startup veterans, so our pace has been quick and agile but our infrastructure is built to scale. We couldn’t be happier with this partnership.\""
    },
    "challengeText": "Ritual engaged RPS to build a minimum viable product (MVP) in 3 months to receive seed funding.",
    "solutionsTexst": "RPS focused on the development of a mobile app and a flexible CMS system. Ritual successfully raised a seed round led by PivotNorth Capital.",
    "results": [
      "RPS released the first version of the iOS platform and CMS app after 3 months. The team focused on gathering qualitative and quantitative user feedback to inform the product roadmap. Over the next 6 months the team added new features, improved existing features, and released an Android app.",
      "Ritual started working with RPS in August 2019 and has built a strong integrated partnership. The combined team continues to work together on new feature development to continue to create a deeper well being experience, grow the user base, and expand the expert community. In addition to software development, RPS is heavily involved in improving feedback tools and methodologies to engage users and create the best possible experience."
    ],
    "businessImpactText": "Ritual raised a seed round led by Tim Connors (Midas List #95) of PivotNorth Capital. The team is seeing consistent user growth, increased user engagement, and revenue growth via subscriptions."
  },
  {
    "introImage": "/images/pictures/walkli-intro.svg",
    "site": "walkli.com",
    "url": "walkli",
    "siteLink": "https://walkli.com/",
    "logo": "/images/logo/products-logo/walkli-logo.svg",
    "features": ["Travel", "Leisure", "Hospitalityz"],
    "introText": "Walkli provides free walking routes for travelers exploring the world on foot in search of local, authentic travel experiences. Maps are crowdsourced from locals, travelers, and bloggers to meet a wide variety of interests from classical history to street art, from local dive bars to a city’s best Instagram spots.",
    "productTeam": [
      "1 Backend developer",
      "1 Frontend developer",
      "1 part-time Product Manager",
      "1 UX/UI Designer"
    ],
    "fundingStage": [
      "Friends & Family"
    ],
    "services": [
      "Backend Development",
      "Frontend Development",
      "iOS Development",
      "API Development",
      "Product Management",
      "UX/UI Design",
      "QA Automation",
      "Technical Architecture",
      "Venture Strategy"
    ],
    "techologies": [
      "/images/logo/tools/php.svg", 
      "Laravel", 
      "MongoDB", 
      "/images/logo/tools/aws.svg", 
      "/images/logo/tools/terraform.svg", 
      "/images/logo/tools/react.svg"
    ],
    "testimonials": {
      "avatar": "/images/avatars/walkli-ceo-avatar.png",
      "name": "Jeff Peo",
      "position": "Founder & CEO",
      "comment": "\"I met with a number of development options – both on- and off-shore – before choosing to work with RPS.  What set them apart was their drive to understand my business and to help determine which features should be built out for the MVP vs. future releases.  This has really enabled me to accurately match my strategic planning with our technical development.\""
    },
    "challengeText": "Walkli did not raise pre-seed funding and was bootstrapped by its Founder. RPS needed to deliver a functional application within a limited budget and timeframe to allow walkli to prove its product/market fit and raise funding.",
    "solutionsTexst": "After product roadmapping, feature scoping, and sizing, RPS and walkli agreed on the parameters and deliverables for the first release. RPS’ Product Manager led one week sprints to gauge team development velocity, before switching to two week sprints. \n Key Features & Integrations: google Maps API customization for custom map creation, admin system with CMS, rich content creation and viewing interfaces, city search functionality, user profiles, social media sharing",
    "results": [
      "- RPS released the first version of the web app after 3 months.",
      "- Walkli has retained RPS for continued iteration and feature development since March 2016.",
      "- Future development plans include the release of a mobile app using the web app’s framework."
    ],
    "businessImpactText": "After the launch of the MVP web app, walkli successfully raised a Friends & Family round. In addition to user growth, walkli successfully launched a travel blogger content partnership program. They secured numerous travel and hospitality clients, including Westin Hotels, Hostelling international, the Amsterdam tourism board, and Croatia tourism board. Walkli was selected as a MassChallenge 2018 finalist."
  },
  {
    "introImage": "/images/pictures/mbamission-picture.png",
    "site": "mbamission.com",
    "url": "mbamission",
    "siteLink": "https://www.mbamission.com",
    "logo": "/images/logo/products-logo/mbaMission-logo.svg",
    "features": [
      "Education",
      "Professional Services"
    ],
    "introText": "Holistic Health International is a medical diagnostics and supplements company founded by Dr. Amy Yasko, Microbiology/Immunology/Infectious Disease specialist and Doctor of Natural Health. Holistic Health specializes in neurological research and the treatment of brain diseases using the Yasko Protocol, including holistic treatment, alternative therapies, and custom supplements.",
    "productTeam": [
      "1 backend developer",
      "1 frontend developer",
      "1 product manager"
    ],
    "fundingStage": [
      "Bootstrapped (not venture funded)"
    ],
    "techologies": [
      "/images/logo/tools/php.svg",
      "Javascript",
      " Slim",
      "Laravel",
      "MongoDB",
      "/images/logo/tools/terraform.svg",
      "/images/logo/tools/aws.svg"
    ],
    "testimonials": {
      "avatar": "/images/avatars/mbamission-director-avatar.png",
      "name": "Aimee Lukin",
      "position": "Director of Marketing and Operations",
      "comment": "\"Remedy has helped us create and maintain several custom systems to streamline our consulting business. As a company with a small team and unique needs, we have relied on RPS every step of the way. They have consistently listened to our pain points and come up with creative solutions. We have always appreciated their honesty and willingness to work within our budgets. They have been an important partner of ours for many years and we fully trust them with our technology needs. \""
    },
    "challengeText": "RPS was asked to build and maintain a flexible system for managing the e-commerce platform and a powerful dashboard for managing business needs.",
    "solutionsTexst": "RPS developed a Billing and Consultant Solutions dashboard that allowed for deeper integration with the Shopify e-commerce platform.",
    "results": [
      "The CRM system is used for processing purchases and managing consultants’ workflow. The solution allows mbaMission administrators and MBA consultants to set availability, track progress, manage their customers, and process payments."
    ],
    "businessImpactText": "Today mbaMission is the number-one-ranked firm on GMAT Club, with more than 1,000 five-star reviews. mbaMission was named the number one business school admissions consulting firm by Poets&Quants in 2019. The technical solution has allowed mbaMission to scale revenue while keeping operational costs low, resulting in a sustainable cash-flow positive company."
  },
  {
    "introImage": "/images/pictures/taproom-picture.png",
    "site": "taproom.app",
    "url": "taproom",
    "siteLink": "https://www.taproom.app",
    "logo": "/images/logo/products-logo/TapRoom-logo.svg",
    "features": ["Social Media", "Video Chat", "Community"],
    "introText": "TapRoom is a mobile app that allows users to videochat in digital versions of real world venues and bars. Users can network, hang out, or learn something in a digital home for their real-world community.",
    "productTeam": [
      "1 full-stack developer",
      "1 product manager"
    ],
    "fundingStage": [
      "Friends & Family"
    ],
    "techologies": [
      "/images/logo/tools/react.svg",
      "/images/logo/tools/firebase.svg'",
      "Twilio",
      "/images/logo/tools/google-maps.svg",
      "Google Places API"
    ],
    "testimonials": {
      "avatar": "/images/avatars/taproom-ceo-avatar.png",
      "name": "Rob Resnick",
      "position": "Founder & CEO",
      "comment": "\"The team at Remedy was incredible.  They were not only fast and dedicated, but as a first time founder I was a little all over the place. They were patient, introduced helpful methodology, and kept everything organized. They were a true partner! I found myself looking forward to our calls, and the product turned out just as I'd imagined it.\""
    },
    "challengeText": "TapRoom engaged RPS to build a minimum viable product (MVP) to launch early, gather feedback, and iterate quickly. Taproom relied on Remedy for leading product strategy, implementing agile development practices, and gathering user feedback.",
    "solutionsTexst": "RPS implemented a lean development process, focusing on keeping a tight initial feature scope. RPS built a cross-platform mobile application, starting with an iOS release.",
    "results": [
      "RPS released an Alpha version of the iOS application in 3 weeks. The team continuously gathered user feedback and iterated, releasing updates with new features. After 3 months, we released an open beta to the iOS app store. An Android application was released shortly thereafter."
    ],
    "businessImpactText": "The application received high ratings and positive reviews. In particular, user testimonials raved about the idea, the look & feel of the app, and novel features, like Whisper. The app has seen user adoption, including large community meetups and networking events."
  }
]
